Revit 2024 API
MassLevelData.NExteriorSurfaceArea Property
 The exterior surface area of the volume of the mass between the level of this MassLevelData (Mass Floor) to the next in the mass.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double NExteriorSurfaceArea { get; }
Visual Basic
Public ReadOnly Property NExteriorSurfaceArea As Double
	Get
Visual C++
public:
property double NExteriorSurfaceArea {
	double get ();
}
See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace